# Create Method (2024)

---
C#Visual BasicVisual C++
Include Protected MembersInclude Inherited Members
Revit 2024 API
---
AreaReinforcement..::..Create Method
AreaReinforcement Class See Also
---
# Overload List
| Name | Description |
| --- | --- |
| --- | --- | --- |
| Create(Document, Element, XYZ, ElementId, ElementId, ElementId) | Creates a new AreaReinforcement object based on a host boundary. |
| Create(Document, Element, IList<(Of <<'(Curve>)>>), XYZ, ElementId, ElementId, ElementId) | Creates a new AreaReinforcement object from an array of curves. This method replaces the NewAreaReinforcement method, which has been deprecated. |

# See Also
AreaReinforcement Class
AreaReinforcement Members
Autodesk.Revit.DB.Structure Namespace